app/views/likes/_counter.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 4]]
---
<p><%= photo.likes.count%> likes</p>