app/views/users/_user.html.erb

SELECT  "users".* FROM "users" WHERE (username ILIKE '%hermione%') AND "users"."id" IN (SELECT "users"."id" FROM "users" WHERE (username ILIKE '%hermione%') ORDER BY created_at DESC) ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
---

<%= link_to "#{@users.find_by(id: @users).username}", user_path(@users.find_by(id: @users)) %>