app/views/photos/index.html.erb

SELECT "photos".* FROM "photos"
---
<div class="photos-index">
  <% Photo.all.each do |photo| %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 1]]
---
    <div class="photo-text">
      <p><%= photo.likes.count%> likes</p>