app/views/photos/show.html.erb


          <p><%= @photo.likes.count%> likes</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 1]]