app/controllers/braintree_controller.rb

UPDATE "users" SET "boost" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["boost", "t"], ["updated_at", "2017-10-17 14:41:01.508450"], ["id", 3]]
---
  def checkout
    nonce_from_the_client = params[:checkout_form][:payment_method_nonce]

    result = Braintree::Transaction.sale(
     :amount => "10.00", #this is currently hardcoded
     :payment_method_nonce => nonce_from_the_client,
     :options => {
        :submit_for_settlement => true
      }
     )

    if result.success?
      current_user.update_attribute(:boost, true)