app/controllers/likes_controller.rb

  def create
    @user = current_user
    @photo = Photo.find_by(id: params[:photo_id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @user = current_user
    @photo = Photo.find_by(id: params[:photo_id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]