app/controllers/photos_controller.rb

  def show
    @photo = Photo.find_by(id: params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @photo = current_user.photos.create(photo_params)
---
INSERT INTO "photos" ("user_id", "created_at", "updated_at", "caption", "photo_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["created_at", "2017-10-16 05:29:39.024740"], ["updated_at", "2017-10-16 05:29:39.024740"], ["caption", "Favicon"], ["photo_url", "54427464-4592-477d-a6c7-241f01d0c248-elabs.png"]]