app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @user = User.find(params[:id])

    @photos = @user.photos.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users") LIMIT $1  [["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE (username ILIKE '%hermione%') AND "users"."id" IN (SELECT "users"."id" FROM "users" WHERE (username ILIKE '%hermione%') ORDER BY created_at DESC) ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]